Обработки/Reports/_РегистрУчетаПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РегистрУчетаПайщиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВоВременномХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пайщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РегистрУчетаПайщиков/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Регистр учета пайщиков", 
		"0.07", 
		"", 
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтотОбъект.Выгружать И ПустаяСтрока(ЭтотОбъект.КаталогДанных) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан путь к файлу"); 
		Возврат;
	КонецЕсли;
	
	// Подготовим список пайщиков для запроса	
	НайдСтроки = ЭтотОбъект.Пайщики.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Если НайдСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Список пайщиков пуст");
		Возврат;
	КонецЕсли;
		
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,КаталогДанных,СчетДоверительногоУправления,РасчетныйСчет");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Макет = ПолучитьМакет("Макет"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
	МассивПайщиков = Новый Массив;
	Для Каждого НайдСтрока Из НайдСтроки Цикл
		МассивПайщиков.Добавить(НайдСтрока.Пайщик);
	КонецЦикла;
	
	ОбщиеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "Наименование, КодСчета");	
	ОбщиеРеквизиты.Вставить("КодСчета", СтрЗаменить(ОбщиеРеквизиты.КодСчета, "DU_", ""));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьДатыОткрытияРегистра77ВМенеджерВременныхТаблиц(Запрос, ОбщиеРеквизиты.КодСчета, МассивПайщиков);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик КАК Пайщик,
	|	МИНИМУМ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Период) КАК ДатаЗаписи
	|ПОМЕСТИТЬ _ДатыОткрытияРегистра_1С8
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.ОстаткиИОбороты(
	|			ДАТАВРЕМЯ(2017, 1, 1),
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И РасчетныйСчет = &РасчетныйСчет
	|				И Пайщик В (&СписокПайщиков)) КАК ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
	|				ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ВводДенежныхСредств).Основание <> ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДатыОткрытияРегистра_1С8.Пайщик КАК Пайщик,
	|	ЕСТЬNULL(_ДатыОткрытияРегистра_1С77.ДатаЗаписи, _ДатыОткрытияРегистра_1С8.ДатаЗаписи) КАК ДатаЗаписи
	|ПОМЕСТИТЬ _ДатыОткрытияРегистра
	|ИЗ
	|	_ДатыОткрытияРегистра_1С8 КАК _ДатыОткрытияРегистра_1С8
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыОткрытияРегистра_1С77 КАК _ДатыОткрытияРегистра_1С77
	|		ПО _ДатыОткрытияРегистра_1С8.Пайщик = _ДатыОткрытияРегистра_1С77.Пайщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик КАК Пайщик,
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Период КАК ДатаВнесенияЗаписи,
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.СуммаНачальныйОстаток КАК ВходящийОстаток,
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.СуммаКонечныйОстаток КАК ИсходящийОстаток,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.СуммаПриход <> 0
	|			ТОГДА ""Зачисление ДС""
	|		ИНАЧЕ ""Списание ДС""
	|	КОНЕЦ КАК ВидОперации,
	|	ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Период КАК ДатаСовершенияОперации,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.СуммаПриход <> 0
	|			ТОГДА ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.СуммаПриход
	|		ИНАЧЕ ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.СуммаРасход
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ВводДенежныхСредств).СтрокаБанковскойВыписки.НомерПлатежногоДокумента
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ПереводДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ПереводДенежныхСредств).СтрокаБанковскойВыписки.НомерПлатежногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерПлатежногоПоручения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ВводДенежныхСредств).СтрокаБанковскойВыписки.ДатаПлатежногоДокумента
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ПереводДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ПереводДенежныхСредств).СтрокаБанковскойВыписки.ДатаПлатежногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаПлатежногоПоручения,
	|	ЕСТЬNULL(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик.Код, """") КАК КодПайщика,
	|	ЕСТЬNULL(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик.Наименование, """") КАК ИмяЛиста,
	|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, """") КАК ФИО,
	|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности, """") КАК СерияПаспорта,
	|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности, """") КАК НомерПаспорта,
	|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности, """") КАК ДатаВыдачиПаспорта,
	|	ЕСТЬNULL(РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности, """") КАК ОрганВыдавшийПаспорт,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу, """") КАК НаименованиеОрганизации,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН, РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН) КАК ИННОрганизации,
	|	_ДатыОткрытияРегистра.ДатаЗаписи КАК ДатаОткрытияРегистра
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И РасчетныйСчет = &РасчетныйСчет
	|				И Пайщик В (&СписокПайщиков)) КАК ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
	|		ПО ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
	|		ПО ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыОткрытияРегистра КАК _ДатыОткрытияРегистра
	|		ПО ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик = _ДатыОткрытияРегистра.Пайщик
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
	|				ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ВводДенежныхСредств).Основание <> ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.)
	|			КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор) = ТИП(Документ.ПереводДенежныхСредств)
	|				ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Регистратор КАК Документ.ПереводДенежныхСредств).Основание <> ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ДенежныеСредстваПереданныеВОплатуПаевОстаткиИОбороты.Пайщик.Наименование, """"),
	|	ДатаСовершенияОперации
	|ИТОГИ
	|	МИНИМУМ(НомерПлатежногоПоручения),
	|	МИНИМУМ(КодПайщика),
	|	МИНИМУМ(ИмяЛиста),
	|	МИНИМУМ(ФИО),
	|	МИНИМУМ(СерияПаспорта),
	|	МИНИМУМ(НомерПаспорта),
	|	МИНИМУМ(ДатаВыдачиПаспорта),
	|	МИНИМУМ(ОрганВыдавшийПаспорт),
	|	МИНИМУМ(НаименованиеОрганизации),
	|	МИНИМУМ(ИННОрганизации),
	|	МИНИМУМ(ДатаОткрытияРегистра)
	|ПО
	|	Пайщик";
	
	Запрос.УстановитьПараметр("НачалоПериода", 					Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 					Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("РасчетныйСчет", 					ЭтотОбъект.РасчетныйСчет);
	Запрос.УстановитьПараметр("СписокПайщиков", 				МассивПайщиков);
	
	РезультатЗапроса = Запрос.Выполнить();
			
	ВыборкаПайщик = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокументРезультат.Очистить();
	
	МассивФайлов = Новый Массив;
	Пока ВыборкаПайщик.Следующий() Цикл
		
		Если Число(ВыборкаПайщик.КодПайщика) > 9999 Тогда
			// В положении выделено только 4 символа, поэтому ругаемся
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + ВыборкаПайщик.ФИО + " код пайщика более 4 символов (" + Формат(Число(ВыборкаПайщик.КодПайщика), "ЧГ=0") + ")");
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
			Возврат;
		КонецЕсли;
		
		Если ЭтотОбъект.Выгружать Тогда
			ДокументРезультат.Очистить();
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаПайщик);
		
		ОбластьШапка.Параметры.НаименованиеФонда 	= ОбщиеРеквизиты.Наименование;
		ОбластьШапка.Параметры.НомерРегистра 		= ОбщиеРеквизиты.КодСчета + "-" + "ДС" + "-" + Прав(ВыборкаПайщик.КодПайщика, 4);
		ОбластьШапка.Параметры.ДатаОткрытияРегистра = Формат(ВыборкаПайщик.ДатаОткрытияРегистра, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ДатаВыдачиПаспорта 	= Формат(ВыборкаПайщик.ДатаВыдачиПаспорта, "ДФ=dd.MM.yyyy");
		
		ДокументРезультат.Вывести(ОбластьШапка);
		
		ВыборкаРегистр = ВыборкаПайщик.Выбрать();
		НПП = 1;
		Пока ВыборкаРегистр.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаРегистр);
			
			ОбластьСтрока.Параметры.НПП 						= НПП;
			ОбластьСтрока.Параметры.ДатаПлатежногоПоручения 	= Формат(ВыборкаРегистр.ДатаПлатежногоПоручения, "ДФ=dd.MM.yyyy");
			ОбластьСтрока.Параметры.ДатаВнесенияЗаписи 			= Формат(ВыборкаРегистр.ДатаВнесенияЗаписи, "ДФ=dd.MM.yyyy");
			ОбластьСтрока.Параметры.ДатаСовершенияОперации 		= Формат(ВыборкаРегистр.ДатаСовершенияОперации, "ДФ=dd.MM.yyyy");
			
			ДокументРезультат.Вывести(ОбластьСтрока);
			
			НПП = НПП + 1;
			
		КонецЦикла;		
		
		Если ЭтотОбъект.Выгружать Тогда
			СохранитьРезультатВФайл(ДокументРезультат, МассивФайлов, ВыборкаПайщик.ИмяЛиста);	
		Иначе
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;  	
		
	КонецЦикла;
	
	Если ЭтотОбъект.Выгружать Тогда
		ЭтотОбъект.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МассивФайлов);
	Иначе
		ЭтотОбъект.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДокументРезультат);
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ПоместитьДатыОткрытияРегистра77ВМенеджерВременныхТаблиц(Запрос, КодСчетаДУ, МассивПайщиков)
	
	ДатыОткрытияРегистра = Новый ТаблицаЗначений;
	
	КС = Новый КвалификаторыСтроки(30);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , , , КС);
	
	ДатыОткрытияРегистра.Колонки.Добавить("КодПайщика", ОписаниеТиповСтрока);
	ДатыОткрытияРегистра.Колонки.Добавить("ДатаЗаписи", Новый ОписаниеТипов("Дата"));
	
	МакетДатыОткрытияРегистра77 = ПолучитьМакет("ДатыОткрытияРегистра77");
		
	Для НомерСтроки = 2 По МакетДатыОткрытияРегистра77.ВысотаТаблицы Цикл
		
		КодСчетаДУВМакете 	= СокрЛП(МакетДатыОткрытияРегистра77.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		
		Если КодСчетаДУВМакете <> КодСчетаДУ Тогда
			Продолжить;
		КонецЕсли;  
		
		КодПайщикаВМакете		= СокрЛП(МакетДатыОткрытияРегистра77.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);		
		ДатаЗаписиВМакете 		= СокрЛП(МакетДатыОткрытияРегистра77.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		
		ДатаЗаписи = ПолучитьДатуИзСтроки(ДатаЗаписиВМакете);
		НоваяСтрока = ДатыОткрытияРегистра.Добавить();		
		НоваяСтрока.КодПайщика = КодПайщикаВМакете;
		НоваяСтрока.ДатаЗаписи = ДатаЗаписи;
		
	КонецЦикла;
	
	// Определим ссылки на элементы справочника
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыОткрытияРегистра.КодПайщика КАК КодПайщика,
	|	ДатыОткрытияРегистра.ДатаЗаписи КАК ДатаЗаписи
	|ПОМЕСТИТЬ _ДатыОткрытияРегистраИзМакета
	|ИЗ
	|	&ДатыОткрытияРегистра КАК ДатыОткрытияРегистра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЮрФизЛица.Ссылка КАК Пайщик,
	|	_ДатыОткрытияРегистраИзМакета.ДатаЗаписи КАК ДатаЗаписи
	|ПОМЕСТИТЬ _ДатыОткрытияРегистра_1С77
	|ИЗ
	|	Справочник.ЮрФизЛица КАК ЮрФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыОткрытияРегистраИзМакета КАК _ДатыОткрытияРегистраИзМакета
	|		ПО ЮрФизЛица.Код = _ДатыОткрытияРегистраИзМакета.КодПайщика
	|ГДЕ
	|	НЕ ЮрФизЛица.ЭтоГруппа
	|	И НЕ ЮрФизЛица.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатыОткрытияРегистра", ДатыОткрытияРегистра);
	Запрос.Выполнить();    		
	
КонецПроцедуры

Процедура СохранитьРезультатВФайл(ДокументРезультат, МассивФайлов, ИмяЛиста)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДокументРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	МассивФайлов.Добавить(Новый Структура("Файл, ИмяЛиста", Новый ДвоичныеДанные(ИмяФайла), ИмяЛиста));
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

Функция ПолучитьДатуИзСтроки(СтрДата)
	
	ДатаИзСтроки = Дата(1, 1, 1);
	
	День = Лев(СтрДата, 2);
	Месяц = Сред(СтрДата, 4, 2);
	Год = Прав(СтрДата, 4);
		
	Возврат Дата(Год + Месяц + День);
	
КонецФункции
